emacs.org
#+title: Emacs configuration

[[https://www.gnu.org/software/emacs/][GNU Emacs]] is an highly extensible and customizable text editor. It presents at its core an interpreter of a [[https://en.wikipedia.org/wiki/Lisp_programming_language][Lisp]] dialect called Emacs Lisp. GNU Emacs is one of the most powerful text editor available today.

** =.spacemacs=
:properties:
:tangle: emacs/spacemacsrc
:padline: no
:mkdirp: yes
:end:

[[http://spacemacs.org/][Spacemacs_]] is a new way to experience GNU Emacs -- a sophisticated starter-kit focused on ergonomics, mnemonics and consistency.

This is the Spacemacs configuration file. it is loaded by Spacemacs at startup, and it must be stored in your =$HOME= directory.

*** Configuration Layers declaration

You should not put any user code in this function besides modifying the variable values.

#+begin_src emacs-lisp
(defun dotspacemacs/layers ()
  (setq-default
#+end_src

Base distribution to use. This is a layer contained in the directory `+distribution'. For now available distributions are `spacemacs-base' or `spacemacs'. (default 'spacemacs)
#+begin_src emacs-lisp
    dotspacemacs-distribution 'spacemacs-base
#+end_src

List of additional paths where to look for configuration layers. Paths must have a trailing slash (i.e. `~/.mycontribs/')
#+begin_src emacs-lisp
    dotspacemacs-configuration-layer-path '()
#+end_src

List of configuration layers to load. If it is the symbol `all' (dotspacemacs-configuration-layers all) instead of a list then all discovered layers will be installed.
#+begin_src emacs-lisp
    dotspacemacs-configuration-layers '(
      auto-completion
      emacs-lisp
      latex
      git
      org
      (shell :variables shell-default-height 30 shell-default-position 'bottom)
      (spell-checking :variables spell-checking-enable-by-default nil)
      syntax-checking
      version-control
    )
#+end_src

List of additional packages that will be installed without being wrapped in a layer. If you need some configuration for these packages then consider to create a layer, you can also put the configuration in `dotspacemacs/config'.
#+begin_src emacs-lisp
    dotspacemacs-additional-packages '(
      jbeans-theme
      cdlatex
      org-ref
      vimish-fold
      ox-reveal
      spaceline
      ob-ipython
      google-translate
      visual-fill-column
      rainbow-mode
      mustache
      web-mode
      pdf-tools
    )
#+end_src

A list of packages and/or extensions that will not be install and loaded.
#+begin_src emacs-lisp
    dotspacemacs-excluded-packages '(org-bullets)
#+end_src

If non-nil spacemacs will delete any orphan packages, i.e. packages that are declared in a layer which is not a member of the list `dotspacemacs-configuration-layers'. (default t)
#+begin_src emacs-lisp
    dotspacemacs-delete-orphan-packages t
#+end_src

Finally, we close the function =dotspacemacs/layers=:
#+begin_src emacs-lisp
))
#+end_src

*** Initialization function

This function is called at the very startup of Spacemacs initialization before layers configuration. You should not put any user code in there besides modifying the variable values.

#+begin_src emacs-lisp
(defun dotspacemacs/init ()
  (setq-default
#+end_src

If non nil ELPA repositories are contacted via HTTPS whenever it's possible. Set it to nil if you have no way to use HTTPS in your environment, otherwise it is strongly recommended to let it set to t. This variable has no effect if Emacs is launched with the parameter `--insecure' which forces the value of this variable to nil. (default t)
#+begin_src emacs-lisp
    dotspacemacs-elpa-https t
#+end_src

Maximum allowed time in seconds to contact an ELPA repository.
#+begin_src emacs-lisp
    dotspacemacs-elpa-timeout 5
#+end_src

If non nil then spacemacs will check for updates at startup when the current branch is not `develop'. (default t)
#+begin_src emacs-lisp
    dotspacemacs-check-for-update t
#+end_src

One of `vim', `emacs' or `hybrid'. Evil is always enabled but if the variable is `emacs' then the `holy-mode' is enabled at startup. `hybrid' uses emacs key bindings for vim's insert mode, but otherwise leaves evil unchanged. (default 'vim)
#+begin_src emacs-lisp
    dotspacemacs-editing-style 'vim
#+end_src

If non nil output loading progress in `*Messages*' buffer. (default nil)
#+begin_src emacs-lisp
    dotspacemacs-verbose-loading t
#+end_src

Specify the startup banner. Default value is `official', it displays the official spacemacs logo. An integer value is the index of text banner, `random' chooses a random text banner in `core/banners' directory. A string value must be a path to an image format supported by your Emacs build. If the value is nil then no banner is displayed. (default 'official)
#+begin_src emacs-lisp
    dotspacemacs-startup-banner 'official
#+end_src

List of items to show in the startup buffer. If nil it is disabled. Possible values are: `recents' `bookmarks' `projects'. (default '(recents projects))
#+begin_src emacs-lisp
    dotspacemacs-startup-lists '(recents projects)
#+end_src

Number of recent files to show in the startup buffer. Ignored if `dotspacemacs-startup-lists' doesn't include `recents'. (default 5)
#+begin_src emacs-lisp
    dotspacemacs-startup-recent-list-size 5
#+end_src

Default major mode of the scratch buffer (default `text-mode')
#+begin_src emacs-lisp
    dotspacemacs-scratch-mode 'text-mode
#+end_src

List of themes, the first of the list is loaded when spacemacs starts. Press <SPC> T n to cycle to the next theme in the list (works great with 2 themes variants, one dark and one light)
#+begin_src emacs-lisp
    dotspacemacs-themes '(
      spacemacs-dark
      spacemacs-light
      jbeans
      solarized-light
      solarized-dark
      leuven
      monokai
      zenburn
    )
#+end_src

If non nil the cursor color matches the state color.
#+begin_src emacs-lisp
    dotspacemacs-colorize-cursor-according-to-state t
#+end_src

Default font. `powerline-scale' allows to quickly tweak the mode-line size to make separators look not too crappy.
#+begin_src emacs-lisp
    dotspacemacs-default-font '(
      "Inconsolata for Powerline"
      :size 15
      :weight normal
      :width normal
      :powerline-scale 1.1
    )
#+end_src

The leader key
#+begin_src emacs-lisp
    dotspacemacs-leader-key "SPC"
#+end_src

The leader key accessible in `emacs state' and `insert state' (default "M-m")
#+begin_src emacs-lisp
    dotspacemacs-emacs-leader-key "M-m"
#+end_src

Major mode leader key is a shortcut key which is the equivalent of pressing `<leader> m`. Set it to `nil` to disable it. (default ",")
#+begin_src emacs-lisp
    dotspacemacs-major-mode-leader-key ","
#+end_src

Major mode leader key accessible in `emacs state' and `insert state'. (default "C-M-m)
#+begin_src emacs-lisp
    dotspacemacs-major-mode-emacs-leader-key "C-M-m"
#+end_src

These variables control whether separate commands are bound in the GUI to the key pairs C-i, TAB and C-m, RET. Setting it to a non-nil value, allows for separate commands under <C-i> and TAB or <C-m> and RET. In the terminal, these pairs are generally indistinguishable, so this only works in the GUI. (default nil)
#+begin_src emacs-lisp
    dotspacemacs-distinguish-gui-tab nil
#+end_src

The command key used for Evil commands (ex-commands) and Emacs commands (M-x). By default the command key is `:' so ex-commands are executed like in Vim with `:' and Emacs commands are executed with `<leader> :'.
#+begin_src emacs-lisp
    dotspacemacs-command-key ":"
#+end_src

If non nil `Y' is remapped to `y$'. (default t)
#+begin_src emacs-lisp
    dotspacemacs-remap-Y-to-y$ t
#+end_src

Name of the default layout (default "Default")
#+begin_src emacs-lisp
    dotspacemacs-default-layout-name "Default"
#+end_src

If non nil the default layout name is displayed in the mode-line. (default nil)
#+begin_src emacs-lisp
    dotspacemacs-display-default-layout nil
#+end_src

If non nil then the last auto saved layouts are resume automatically upon start. (default nil)
#+begin_src emacs-lisp
    dotspacemacs-auto-resume-layouts nil
#+end_src

Location where to auto-save files. Possible values are `original' to auto-save the file in-place, `cache' to auto-save the file to another file stored in the cache directory and `nil' to disable auto-saving. (default 'cache)
#+begin_src emacs-lisp
    dotspacemacs-auto-save-file-location 'cache
#+end_src

Maximum number of rollback slots to keep in the cache. (default 5)
#+begin_src emacs-lisp
    dotspacemacs-max-rollback-slots 5
#+end_src

If non nil then `ido' replaces `helm' for some commands. For now only `find-files' (SPC f f), `find-spacemacs-file' (SPC f e s), and `find-contrib-file' (SPC f e c) are replaced. (default nil)
#+begin_src emacs-lisp
    dotspacemacs-use-ido nil
#+end_src

If non nil, `helm' will try to miminimize the space it uses. (default nil)
#+begin_src emacs-lisp
    dotspacemacs-helm-resize nil
#+end_src

if non nil, the helm header is hidden when there is only one source. (default nil)
#+begin_src emacs-lisp
    dotspacemacs-helm-no-header nil
#+end_src

define the position to display `helm', options are `bottom', `top', `left', or `right'. (default 'bottom)
#+begin_src emacs-lisp
    dotspacemacs-helm-position 'bottom
#+end_src

If non nil the paste micro-state is enabled. When enabled pressing `p` several times cycle between the kill ring content. (default nil)
#+begin_src emacs-lisp
    dotspacemacs-enable-paste-micro-state nil
#+end_src

Which-key delay in seconds. The which-key buffer is the popup listing the commands bound to the current keystroke sequence. (default 0.4)
#+begin_src emacs-lisp
    dotspacemacs-which-key-delay 0.4
#+end_src

Which-key frame position. Possible values are `right', `bottom' and `right-then-bottom'. right-then-bottom tries to display the frame to the right; if there is insufficient space it displays it at the bottom. (default 'bottom)
#+begin_src emacs-lisp
    dotspacemacs-which-key-position 'bottom
#+end_src

If non nil a progress bar is displayed when spacemacs is loading. This may increase the boot time on some systems and emacs builds, set it to nil to boost the loading time. (default t)
#+begin_src emacs-lisp
    dotspacemacs-loading-progress-bar t
#+end_src

If non nil the frame is fullscreen when Emacs starts up. (default nil) (Emacs 24.4+ only)
#+begin_src emacs-lisp
    dotspacemacs-fullscreen-at-startup nil
#+end_src

If non nil `spacemacs/toggle-fullscreen' will not use native fullscreen. Use to disable fullscreen animations in OSX. (default nil)
#+begin_src emacs-lisp
    dotspacemacs-fullscreen-use-non-native nil
#+end_src

If non nil the frame is maximized when Emacs starts up. Takes effect only if `dotspacemacs-fullscreen-at-startup' is nil. (default nil) (Emacs 24.4+ only)
#+begin_src emacs-lisp
    dotspacemacs-maximized-at-startup nil
#+end_src

A value from the range (0..100), in increasing opacity, which describes the transparency level of a frame when it's active or selected. Transparency can be toggled through `toggle-transparency'. (default 90)
#+begin_src emacs-lisp
    dotspacemacs-active-transparency 90
#+end_src

A value from the range (0..100), in increasing opacity, which describes the transparency level of a frame when it's inactive or deselected. Transparency can be toggled through `toggle-transparency'. (default 90)
#+begin_src emacs-lisp
    dotspacemacs-inactive-transparency 50
#+end_src

If non nil unicode symbols are displayed in the mode line. (default t)
#+begin_src emacs-lisp
    dotspacemacs-mode-line-unicode-symbols t
#+end_src

If non nil smooth scrolling (native-scrolling) is enabled. Smooth scrolling overrides the default behavior of Emacs which recenters the point when it reaches the top or bottom of the screen. (default t)
#+begin_src emacs-lisp
    dotspacemacs-smooth-scrolling t
#+end_src

If non nil line numbers are turned on in all `prog-mode' and `text-mode' derivatives. If set to `relative', also turns on relative line numbers. (default nil)
#+begin_src emacs-lisp
    dotspacemacs-line-numbers nil
#+end_src

If non-nil smartparens-strict-mode will be enabled in programming modes. (default nil)
#+begin_src emacs-lisp
    dotspacemacs-smartparens-strict-mode nil
#+end_src

Select a scope to highlight delimiters. Possible values are `any', `current', `all' or `nil'. Default is `all' (highlight any scope and emphasis the current one). (default 'all)
#+begin_src emacs-lisp
    dotspacemacs-highlight-delimiters 'all
#+end_src

If non nil advises quit functions to keep server open when quitting. (default nil)
#+begin_src emacs-lisp
    dotspacemacs-persistent-server nil
#+end_src

List of search tool executable names. Spacemacs uses the first installed tool of the list. Supported tools are `ag', `pt', `ack' and `grep'. (default '("ag" "pt" "ack" "grep"))
#+begin_src emacs-lisp
    dotspacemacs-search-tools '("ag" "pt" "ack" "grep")
#+end_src

The default package repository used if no explicit repository has been specified with an installed package. Not used for now. (default nil)
#+begin_src emacs-lisp
    dotspacemacs-default-package-repository nil
#+end_src

Delete whitespace while saving buffer. Possible values are `all' to aggressively delete empty line and long sequences of whitespace, `trailing' to delete only the whitespace at end of lines, `changed'to delete only whitespace for changed lines or `nil' to disable cleanup. (default nil)
#+begin_src emacs-lisp
    dotspacemacs-whitespace-cleanup 'trailing
#+end_src

#+begin_src emacs-lisp
))
#+end_src

*** Initialization function for user code

Initialization function for user code. It is called immediately after `dotspacemacs/init'.  You are free to put any user code.

#+begin_src emacs-lisp
(defun dotspacemacs/user-init ()
)
#+end_src

