emacs.org
*** Configuration function for user code

Configuration function for user code. This function is called at the very end of Spacemacs initialization after layers configuration. You are free to put any user code.
#+begin_src emacs-lisp
(defun dotspacemacs/user-config ()
#+end_src

Change user-reserved prefix name
#+begin_src emacs-lisp
  (spacemacs/declare-prefix "o" "user-defined-prefix")
#+end_src

Enable clipboard in emacs
#+begin_src emacs-lisp
  (defun copy-to-clipboard ()
    "Copies selection to x-clipboard."
    (interactive)
    (if (display-graphic-p)
        (progn
          (message "Yanked region to x-clipboard!")
          (call-interactively 'clipboard-kill-ring-save)
          )
      (if (region-active-p)
          (progn
            (shell-command-on-region (region-beginning) (region-end) "xsel -i -b")
            (message "Yanked region to clipboard!")
            (deactivate-mark))
        (message "No region active; can't yank to clipboard!"))))

  (defun paste-from-clipboard ()
    "Pastes from x-clipboard."
    (interactive)
    (if (display-graphic-p)
        (progn
          (clipboard-yank)
          (message "graphics active")
          )
      (insert (shell-command-to-string "xsel -o -b"))
      )
    )
  (spacemacs/set-leader-keys "oy" 'copy-to-clipboard)
  (spacemacs/set-leader-keys "op" 'paste-from-clipboard)
#+end_src

The default old spacemacs modeline was moved to a separate project, [[https://github.com/TheBB/spaceline][spaceline]], and therefore you must include it separately:
#+begin_src emacs-lisp
  (require 'spaceline-config)
  (spaceline-spacemacs-theme)
#+end_src

Add user elisp code to emacs' =PATH=
#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.elisp/")
  (let ((default-directory "~/.elisp/"))
    (normal-top-level-add-subdirs-to-load-path))
#+end_src

Nice abbreviations for people like me who forget sometimes and keep pressing Shift key while typing.
#+begin_src emacs-lisp
  (eval-after-load 'evil-ex '(evil-ex-define-cmd "W[rite]" 'save-buffer))
  (eval-after-load 'evil-ex '(evil-ex-define-cmd "Wq" 'evil-save-and-close))
  (eval-after-load 'evil-ex '(evil-ex-define-cmd "wQ" 'evil-save-and-close))
  (eval-after-load 'evil-ex '(evil-ex-define-cmd "WQ" 'evil-save-and-close))
#+end_src

Fixing visual lines navigation: I got this solution [[https://github.com/syl20bnr/spacemacs/pull/1446][here]]. Make evil-mode up/down operate in screen lines instead of logical lines, both in normal state and visual mode.
#+begin_src emacs-lisp
  (define-key evil-normal-state-map "j" 'evil-next-visual-line)
  (define-key evil-normal-state-map (kbd "<down>" ) 'evil-next-visual-line)
  (define-key evil-normal-state-map "k" 'evil-previous-visual-line)
  (define-key evil-normal-state-map (kbd "<up>" ) 'evil-previous-visual-line)
  (define-key evil-visual-state-map "j" 'evil-next-visual-line)
  (define-key evil-visual-state-map (kbd "<down>" ) 'evil-next-visual-line)
  (define-key evil-visual-state-map "k" 'evil-previous-visual-line)
  (define-key evil-visual-state-map (kbd "<up>" ) 'evil-previous-visual-line)
#+end_src

Make org-mode work with files ending in .org
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
#+end_src

Fringe indicators for visual line mode
#+begin_src emacs-lisp
  (setq visual-line-fringe-indicators
    '(left-curly-arrow right-curly-arrow))
#+end_src

Activate pdf-tools
#+begin_src emacs-lisp
  (pdf-tools-install)
#+end_src

Google translate configuration
#+begin_src emacs-lisp
(require 'google-translate)
(require 'google-translate-smooth-ui)

(setq google-translate-translation-directions-alist
  '(("pt" . "en") ("en" . "pt")))

;; Run google-translate query with SPC x g t
(spacemacs/set-leader-keys "xgt" 'google-translate-smooth-translate)
#+end_src

Use this at your risk! I'm NOT conservative regarding local file variable, as I always know the code I'll be executing.
#+begin_src emacs-lisp
    (setq enable-local-variables :all)
#+end_src

**** mu4e configuration
First we load mu4e
#+begin_src emacs-lisp
(require 'mu4e)
(add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")
#+end_src

and then we configure it:
#+begin_src emacs-lisp
(with-eval-after-load 'mu4e
  (load-file "~/.elisp/helm-goobook.el")

  (setq mu4e-mu-binary "/usr/bin/mu")
  (setq mu4e-maildir (expand-file-name "~/.maildir"))
  (setq mu4e-view-show-images t)
  (setq mu4e-html2text-command "w3m -dump -T text/html")
  (setq mu4e-view-prefer-html t)
  (setq mu4e-headers-skip-duplicates t)
  (setq mu4e-get-mail-command "offlineimap -q")
  (setq mu4e-update-interval 300)
  (setq mu4e-attachment-dir  "~/0.Inbox")
  (setq mu4e-drafts-folder "/[Gmail].Drafts")
  (setq mu4e-sent-folder   "/[Gmail].Sent Mail")
  (setq mu4e-trash-folder  "/[Gmail].Trash")
  (setq mu4e-sent-messages-behavior 'delete)
  (setq message-kill-buffer-on-exit t)
  (setq mu4e-hide-index-messages t)
  (setq
   user-mail-address "victor_santos@fisica.ufc.br"
   user-full-name  "Victor Santos"
   mu4e-compose-signature
   (concat
    "vct\n"))

  ;; smtpmail
  (require 'smtpmail)
  (require 'starttls)
  (setq message-send-mail-function 'smtpmail-send-it
        smtpmail-stream-type 'starttls
        smtpmail-smtp-service 587
        smtpmail-default-smtp-server "smtp.gmail.com"
        smtpmail-smtp-server "smtp.gmail.com"
        smtpmail-smtp-user "victor.phb@gmail.com")

  (defun vct:mail-compose-hooks ()
    "Settings for message composition."
    (flyspell-mode)
    (turn-off-auto-fill)
    (setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
    (visual-line-mode 1))

  (add-hook 'mu4e-compose-mode-hook 'vct:mail-compose-hooks)
  (add-hook 'message-mode-hook 'vct:mail-compose-hooks)
)
#+end_src

**** Org-mode configuration
[[orgmode.org][Org-mode]] is an editing and organizing mode for notes, planning, and authoring in the free software text editor Emacs.

Configuration to be done AFTER load org
#+begin_src emacs-lisp
  (with-eval-after-load 'org
#+end_src

[[https://github.com/joostkremers/visual-fill-column][Visual Fill Column]] is a minor mode which mimics the effect of fill-column in visual-line-mode: instead of wrapping lines at window edge, it wraps at fill-column
#+begin_src emacs-lisp
  (require 'visual-fill-column)

  ;; Enable visual line mode
  (add-hook 'org-mode-hook 'visual-line-mode)

  ;; Soft-wrap at column 80
  (setq visual-fill-column-width 80)
  (add-hook 'org-mode-hook 'visual-fill-column-mode)
#+end_src

<<cdlatex>>
Speedup insertion of LaTeX environments with [[https://staff.fnwi.uva.nl/c.dominik/Tools/cdlatex/][CDLaTeX]]:
#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'turn-on-org-cdlatex)
#+end_src

Update all dynamic blocks before export
#+begin_src emacs-lisp
(add-hook 'org-export-before-processing-hook
  (lambda (backend)
    (org-update-all-dblocks)))
#+end_src

Partial LaTeX syntax highlighting in org-mode buffers
#+begin_src emacs-lisp
    (font-lock-add-keywords 'org-mode
      '(("\\(\\\\begin\\|\\\\end\\)\\(?:\{\\)\\(.*\\)\\(?:\}\\)"
         (1 'font-lock-keyword-face)
         (2 'font-lock-function-name-face))
        ("\\(\\\\eqref\\|\\\\ref\\|\\\\href\\|\\\\label\\)\\(?:\{\\)\\(.*\\)\\(?:\}\\)"
         (1 'font-lock-keyword-face)
         (2 'font-lock-constant-face))
        ("\\(\\\\textrm\\|\\\\frac\\)"
         (1 'font-lock-keyword-face))))
#+end_src

Syntax sugar for font formatting
#+begin_src emacs-lisp
    (add-to-list 'org-emphasis-alist
        '("*" (:foreground "white" :weight bold)))

    (add-to-list 'org-emphasis-alist
        '("/" (:inherit italic :family "Monospace" :height 0.95)))

    ;; Hide markers
    (setq org-hide-emphasis-markers t)
#+end_src

Bigger LaTeX previews
#+begin_src emacs-lisp
    (plist-put org-format-latex-options :scale 1.5)
#+end_src

org-ref configuration
#+begin_src emacs-lisp
    (require 'org-ref)
    (setq org-ref-default-citation-link "eqref")
#+end_src

Limit the size of picture preview
#+begin_src emacs-lisp
    (setq org-image-actual-width 300)
#+end_src

Set default font for tags
#+begin_src emacs-lisp
    (custom-set-faces
      '(org-tag ((t (:foreground "DarkOrange3" :background "gray13" :box t)))))
#+end_src

Change ltxpng folder location for LaTeX previews
#+begin_src emacs-lisp
    (setq org-latex-preview-ltxpng-directory "~/.ltxpng/")
#+end_src

CDLaTex configuration (it was loaded [[cdlatex][here]])
#+begin_src emacs-lisp
    (setq cdlatex-env-alist
      '(
        ("vct-eqn" "\\begin{equation}\n?\n\\end{equation}\n" nil)
        ("vct-alg" "\\begin{align}\n?\n\\end{align}\n" nil)
       )
    )
    (setq cdlatex-command-alist
      '(
        ("equation" "Insert non-labeled equation" "" cdlatex-environment ("vct-eqn") t nil)
        ("equat" "Insert non-labeled equation" "" cdlatex-environment ("vct-eqn") t nil)
        ("align" "Insert non-labeled align" "" cdlatex-environment ("vct-alg") t nil)
        ("alig" "Insert non-labeled align" "" cdlatex-environment ("vct-alg") t nil)
       )
    )
#+end_src

This makes my life easier when typesetting tensors using abstract index notation
#+begin_src emacs-lisp
    (setq cdlatex-math-symbol-alist '((?p ("\\phantom{?}"))))
#+end_src

Uses latexmk for exporting
#+begin_src emacs-lisp
    (setq org-latex-pdf-process '("latexmk -pdf %f"))
#+end_src

LaTeX backend specific
#+begin_src emacs-lisp
    (require 'ox-latex)

    (setq org-latex-prefer-user-labels t)

    ;; Remove headline title before export
    (defun ignored-headlines-removal (backend)
      (org-map-entries
        (lambda ()
          (delete-region (point)
            (progn (forward-line) (point)))) "ignore_heading"))
    (add-hook 'org-export-before-parsing-hook 'ignored-headlines-removal)
#+end_src

For site publishing
#+begin_src emacs-lisp
    (require 'ox-publish)
#+end_src

For ignore_headline tag. Any headline tagged with 'ignore' will be ignored, while keeping its contents
#+begin_src emacs-lisp
    (require 'ox-extra)
    (ox-extras-activate '(ignore-headlines))
#+end_src

Load programming languages
#+begin_src emacs-lisp
    (org-babel-do-load-languages 'org-babel-load-languages '(
      (python . t)
      (C . t)
      (emacs-lisp . t)
      (gnuplot . t)
      (haskell . t)
      (shell . t)
    ))
#+end_src

Add support for IPython/Jupyter
#+begin_src emacs-lisp
(require 'ob-ipython)
#+end_src

Closing =with-eval-after-load 'org=
#+begin_src emacs-lisp
  )
#+end_src

**** LaTeX configuration

Normal font size in AUCTeX titles
#+begin_src emacs-lisp
  (setq font-latex-fontify-sectioning 'color)
#+end_src

Closing =defun dotspacemacs/user-config=
#+begin_src emacs-lisp
)
#+end_src




** Custom elisp folder
*** Helm and Goobook
:properties:
:tangle: emacs/elisp/helm-goobook.el
:padline: no
:mkdirp: yes
:end:
#+begin_src emacs-lisp
;;; helm-goobook.el
;; Copyright 2016 Shivam Kalra
;;
;; Author: Shivam Kalra <skalra@gmx.ca>

;;; Code:
(defun goobook-search (search-term)
  (message search-term)
  (process-lines "goosearch" search-term))

(defun helm-goobook-search ()
  (mapcar (lambda (entry)
            (let* ((vals (split-string entry "\t"))
                   (email (car vals))
                   (name (car (cdr vals)))
                   (key (format "%s <%s>" name email)))
              `(,key
                (name . ,name)
                (email . ,email)
                (val . ,key)))) (goobook-search helm-pattern)))

(defun helm-goobook-insert-key (entry)
  (with-helm-current-buffer
    (insert (cdr (assoc 'val entry)))))

(defun helm-goobook-insert-name (entry)
  (with-helm-current-buffer
    (insert (cdr (assoc 'name entry)))))

(defun helm-goobook-insert-email (entry)
  (with-helm-current-buffer
    (insert (cdr (assoc 'email entry)))))

(defvar helm-source-goobook
  '((name . "Goobook Search")
    (volatile)
    (delayed)
    (requires-pattern . 3)
    (candidates .  helm-goobook-search)
    (action . (("Insert key" . helm-goobook-insert-key)
               ("Insert email" . helm-goobook-insert-email)
               ("Insert name" . helm-goobook-insert-name)))))

(defun helm-goobook ()
  (interactive)
  (helm :sources '(helm-source-goobook)
	:buffer "*helm-goobook*"))
#+end_src
*** Org-mode LaTeX custom classes
**** JCAP class
:properties:
:tangle: emacs/elisp/jcap.el
:padline: no
:mkdirp: yes
:end:

#+begin_src emacs-lisp
(require 'ox-latex)
(unless (boundp 'org-latex-classes) (setq org-latex-classes nil))
(add-to-list 'org-latex-classes '("jcap"
"\\documentclass[11pt,a4paper]{article}
\\usepackage{jcappub}
\\usepackage{float} % Useful for right positioning of figures and tables
[NO-DEFAULT-PACKAGES]
[PACKAGES]
[EXTRA]"
("\\section{%s}" . "\\section*{%s}")
("\\subsection{%s}" . "\\subsection*{%s}")
("\\subsubsection{%s}" . "\\subsubsection*{%s}")))
#+end_src

**** Article draft
:properties:
:tangle: emacs/elisp/org-article-draft.el
:padline: no
:mkdirp: yes
:end:

#+begin_src emacs-lisp
(unless (boundp 'org-latex-classes)
  (setq org-latex-classes nil))

(setq org-latex-listings 'minted)
(setq org-latex-minted-options '(
  ("frame" "lines")
  ("fontsize" "\\scriptsize")
))

(setq org-latex-pdf-process '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

(require 'ox-latex)

;; Do not ask confirmation for evaluating code blocks
(setq org-confirm-babel-evaluate nil)

(add-to-list 'org-export-filter-src-block-functions
  (lambda (contents backend info)
    (when (eq backend 'latex)
      (replace-regexp-in-string "ipython" "python" contents))))

(add-to-list 'org-latex-classes
  '("org-article-draft"
"\\documentclass[12pt,a4paper]{article}

% Font/encoding
\\usepackage[T1]{fontenc}
\\usepackage[utf8]{inputenc}

% Language and geometry
\\usepackage[english]{babel}
\\usepackage[top=2cm,bottom=2cm,left=2cm,right=2cm]{geometry}

% Set link colors (from http://tex.stackexchange.com/questions/100905/best-practice-for-hyperref-link-colours)
\\usepackage[dvipsnames]{xcolor}
\\usepackage{hyperref}
\\usepackage{cleveref}
\\newcommand\\myshade{85}
\\colorlet{mylinkcolor}{violet}
\\colorlet{mycitecolor}{YellowOrange}
\\colorlet{myurlcolor}{Aquamarine}
\\hypersetup{
  linkcolor  = mylinkcolor!\\myshade!black,
  citecolor  = mycitecolor!\\myshade!black,
  urlcolor   = myurlcolor!\\myshade!black,
  colorlinks = true
}
\\usepackage{float} % Useful for right positioning of figures and tables
% Math packages
\\usepackage{amsmath,amssymb,amsfonts,amsthm}
% For include figures
\\usepackage{graphicx}
% For source code listings
\\usepackage[cache=false]{minted}

\\makeatletter
\\renewcommand{\\maketitle}{%
\\begin{center}%
{\\LARGE \\@title \\par}%
\\vskip 1.5em%
{{\\small\\@author}\\par}%
{{\\itshape\\@date}\\par}%
\\end{center}%
}\\makeatother

[NO-DEFAULT-PACKAGES]
[PACKAGES]
[EXTRA]"
  ("\\part{%s}" . "\\part*{%s}")
  ("\\section{%s}" . "\\section*{%s}")
  ("\\subsection{%s}" . "\\subsection*{%s}")
  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  ("\\paragraph{%s}" . "\\paragraph*{%s}")
  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+end_src

Dynamic blocks
#+begin_src emacs-lisp
(defun get-string-from-file (filePath)
  "Return filePath's file content."
  (with-temp-buffer
    (insert-file-contents filePath)
    (buffer-string)))

(defun org-dblock-write:insert-abstract (params)
  (let ((file (plist-get params :file)))
    (insert (format "#+begin_abstract\n%s\n#+end_abstract" (get-string-from-file file)))
  )
)
#+end_src

