emacs/elisp.symlink/org-article-draft.el
(require 'ox-latex)
(unless (boundp 'org-latex-classes)
  (setq org-latex-classes nil))
(add-to-list 'org-latex-classes
  '("org-article-draft"
"\\documentclass[12pt,a4paper]{article}
% Language and geometry
\\usepackage[english]{babel}
